base/Enums/бит_ВидыКорректировокКонтрольныхЗначений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыКорректировокКонтрольныхЗначений</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изменение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЛимита</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Enums/бит_РежимыКонтроляПоБюджету.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_РежимыКонтроляПоБюджету</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Заявки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГрафикиДоговоров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бюджет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Enums/бит_ВидыКорректировокКонтрольныхЗначений/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений(); 
	ДанныеВыбора.Добавить(Перечисления.бит_ВидыКорректировокКонтрольныхЗначений.ЗаСчет);
	ДанныеВыбора.Добавить(Перечисления.бит_ВидыКорректировокКонтрольныхЗначений.Изменение);
	
	Если Параметры.Свойство("ВидКонтроля") Тогда
		Если Параметры.ВидКонтроля = Перечисления.бит_РежимыКонтроляПоБюджету.Заявки Тогда
			ДанныеВыбора.Добавить(Перечисления.бит_ВидыКорректировокКонтрольныхЗначений.ВозвратЛимита);
		КонецЕсли; 
	КонецЕсли; 
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
